app/views/gallery/index.html.erb

<div class="cover">
  <% first = Article.first %>
---
SELECT "articles".* FROM "articles" ORDER BY "articles"."id" ASC LIMIT ?  [["LIMIT", 1]]

<div class="grid">
  <% Article.all.sample(5).each do |ar| %>
---
SELECT "articles".* FROM "articles"